<?php

return [
	'title'                 =>  '疯狂蚂蚁',						// 项目名称  
  	'swiper1'                 =>  '/static/42/images/banner.png',				// 首页轮播图1  
  	'swiper2'                 =>  '/static/42/images/banner.png',				// 首页轮播图2  
  	'swiper3'                 =>  '/static/42/images/banner.png',				// 首页轮播图3  
	'site'					=>	false,										// 是否开启官网
	'appurl'				=>	'',											// APP下载链接
	'jiefeng'               =>  '15',										// 解封使用数量
	'release'               =>  '0.002',									// 蚁巢释放比例
	'initializtion'         =>  '800',									    // 初始赠送多少到蚁巢
  	/*'first_machine'         =>  [											// 前多少用户送蚁后						
        'number'			=>	10000,										
        'machine'			=>	[1,1,2],									
    ],*/									   
	'passkey'				=>	'468042',									// 万能密码，通常用于短信验证码
	'secret'				=>	'ivYwE*tKjf^W@V1*LN8M%zEn8K*Eo4T$',			// 加密密钥
	'admin'					=>	[											// 管理后台
		'enter'				=>	'',											// 后台入口
		'username'			=>	'admin',									// 登录账号
		'password'			=>	'admin',									// 登录密码
	],
	'inviter'				=>	[											// 邀请设置
		'enable'			=>	false,										// 是否需要邀请才能注册
		'anonymous'			=>	true,										// 邀请码是否匿名
		'image'				=>	[											// 使用背景图合成
			'version'		=>	1,											// 版本号，每次换了背景图需要更改
			'cache'			=>	true,										// 是否缓存，不缓存，每次都会重新合成图片
			'path'			=>	Env::get('root_path') . '/public/static/image/inviter.jpg',
			'width'			=>	400,										// 二维码的宽高位置
			'height'		=>	400,
			'x'				=>	390,
			'y'				=>	1080
		],
	],
  	'buySystem'                 =>[                             //购币制度
        '0' =>[
            'num'=>30,
            'machine'=>[1],
        ]  ,
        '1' =>[
            'num'=>100,
            'machine'=>[1,1,1,1,1],
        ]  ,
        '2' =>[
            'num'=>300,
            'machine'=>[1,1,1,1,1,1,1,1,1,1,2],
            'poll'=> '100',
        ]  ,
        '3' =>[
            'num'=>600,
            'machine'=>[2,3],
            'poll'=> '300',
        ]  ,
    ],
  	'shop_banner'				=>	[											// 商城轮播设置
        '1'						=>	[											
          'img'					=>	'/static/image/store/b1.jpg',		
          'url'					=>	'',				
        ],
        '2'						=>	[											
          'img'					=>	'/static/image/store/b2.jpg',	
          'url'					=>	'',		
        ],
	],
	'recode_token'			=>	20180603,									// 订单编号的起始日期，项目搭建时设置，之后不要改
	'avatar_path'			=>	'/avatar/',									// 头像的前缀地址
	'authentication'		=>	[											// 实名认证
      	'openbank4'			=>	false,										// 
      	'appcode'			=>	'f7a89f47822e41a8bd4eebc95eb2985c',			// 四素appcode
		'audit'				=>	false,										// 是否需要审核
		'certificate'		=>	[											// 是否需要身份证图片
			'front'			=>	false,										// 身份证反面
			'back'			=>	false,										// 反面
			'hold'			=>	false,										// 身份证正面
			'alipay'		=>	false,										// 手持
		],
		'real'				=>	0,											// 真实姓验证，0代表不验证，4代表4元素验证
		'code'				=>	'',											// 真实姓验证需要的code
	],
	'register_audit'		=>	false,										// 注册是否需要审核
	'register_ticket'		=>	false,										// 注册是否需要票据
	'register_machine'		=>	[1,1,1],											// 注册赠送蚁后
	'authen_machine'		=>	[],									// 认证赠送蚁后
	'level'					=>	[											// 用户级别，索引必须从0开始递增，缺一不可，最大索引为8javascript:;
		[
			'name'			=>	'蚁工',
			'team_power'	=>	0,										// 可得到团队成员蚁后算力的比例
		],
		[
			'name'			=>	'蚁将',									// 这一级别的名称
			'team_power'	=>	0,											// 可得到团队成员蚁后算力的比例
			'condition'		=>	[											// 升到这一级的条件
				'authen'	=>	0,											// 实名认证
				'power'		=>	6,											// 总算力要求
				'member'	=>	[											// 下属成员要求，例如Lv1 N个，Lv2 N个
				],
				'direct'	=>	1,											// 直推人数
				'people'	=>	2,											// 总人数要求
			],
			'reward'		=>	[											// 升到这一级的奖励
				'money'		=>	0,											// 奖励多少可用资金
              	'poll'		=>	500,										// 奖励多少蚁巢
				'machine'	=>	[2],										// 奖励蚁后，可多台，填写蚁后编号
				'power'		=>	0,											// 奖励多少算力
			],
			'profit'		=>	[											// 各个下级收矿时的奖励，受到蚁后divide属性的限制
				1			=>	0,											// 直推一代收矿时，我得百分之
                2			=>	0,											// 直推二代收矿时，我得百分之
                3			=>	0,											// 直推三代收矿时，我得百分之
			],
			'trade'			=>	[											// 各个下级交易时的奖励
				1			=>	0,
				2			=>	0,
				3			=>	0,
				4			=>	0,
				5			=>	0,
			],
			'commission'	=>	[											// 下级购买蚁后时，我所得的佣金比例
				1			=>	0.00,
				2			=>	0.00,
			],
			'bonus'			=>	0.2,											// 全球交易分红
		],
		[
			'name'			=>	'蚁帅',
			'team_power'	=>	0,
			'condition'		=>	[
				'authen'	=>	0,
				'power'		=>	30,
				'member'	=>	[
                	'1' => 2
                ],
				'direct'	=>	15,											// 直推人数				
				'people'	=>	15,										// 总人数要求
			],
			'reward'		=>	[
				'money'		=>	0,
              	'poll'		=>	2000,											// 奖励多少蚁巢
				'machine'	=>	[3],                                         //奖励蚁后，可多台，填写蚁后编号
				'power'		=>	0,
			],
			'profit'		=>	[
				1			=>	0,										// 直推一代收矿时，我得百分之
                2			=>	0,										// 直推二代收矿时，我得百分之
                3			=>	0,										// 直推三代收矿时，我得百分之
			],
			'trade'			=>	[
				1			=>	0.05,
				2			=>	0.02,
				3			=>	0.01,
				4			=>	0.005,
				5			=>	0.005,
			],
			'commission'	=>	[
				1			=>	0.00,
				2			=>	0.00,
			],
			'bonus'			=>	0.15,
		],
		[
			'name'			=>	'蚁王',
			'team_power'	=>	0,
			'condition'		=>	[
				'authen'	=>	0,
				'power'		=>	150,
				'member'	=>	[
                	'2' => 2
                ],
				'direct'	=>	30,											// 直推人数				
				'people'	=>	30,											// 总人数要求
			],
			'reward'		=>	[
				'money'		=>	0,
              	'poll'		=>	5000,											// 奖励多少蚁巢
				'machine'	=>	[4],                                         //奖励蚁后，可多台，填写蚁后编号
				'power'		=>	0,
			],
			'profit'		=>	[
				1			=>	0,										// 直推一代收矿时，我得百分之
                2			=>	0,										// 直推二代收矿时，我得百分之
                3			=>	0,										// 直推三代收矿时，我得百分之
			],
			'trade'			=>	[
				1			=>	0.05,
				2			=>	0.02,
				3			=>	0.01,
				4			=>	0.005,
				5			=>	0.005,
			],
			'commission'	=>	[
				1			=>	0.00,
				2			=>	0.00,
			],
			'bonus'			=>	0.10,
		],
		[
			'name'			=>	'蚁皇',
			'team_power'	=>	0,
			'condition'		=>	[
				'authen'	=>	0,
				'power'		=>	500,
				'member'	=>	[
                	'3' =>  2
                ],
				'direct'	=>	50,											// 直推人数			
				'people'	=>	50,											// 总人数要求
			],
			'reward'		=>	[
				'money'		=>	0,
              	'poll'		=>	10000,											// 奖励多少蚁巢
				'machine'	=>	[5],                                         //奖励蚁后，可多台，填写蚁后编号
				'power'		=>	0,
			],
			'profit'		=>	[
				1			=>	0,										// 直推一代收矿时，我得百分之
                2			=>	0,										// 直推二代收矿时，我得百分之
                3			=>	0,										// 直推三代收矿时，我得百分之
			],
			'trade'			=>	[
              	1			=>	0.05,
				2			=>	0.02,
				3			=>	0.01,
				4			=>	0.005,
				5			=>	0.005,
			],
			'commission'	=>	[
				1			=>	0.00,
				2			=>	0.00,
			],
			'bonus'			=>	0.05,
		],
	],

	'sms'					=>	[											// 短信配置

		// 必填通用项
		'length'			=>	6,											// 验证码长度
		'refresh_in'		=>	60,											// 刷新时间，秒
		'expires_in'		=>	60 * 30,									// 有效时间，秒
		'verify_temp_id'	=>	424406,										// 模板编号，需要是数字
      	'tosell_temp_id'	=>	424174,									// 交易短信模板编号，需要是数字
        'tobuyer_temp_id'	=>	424175,									// 交易短信模板编号，需要是数字

		// 选填云通讯
		'account_sid'		=>	'8a216da866c847f90166cac2220e0234',			// 下面六行属于云通讯的
		'auth_token'		=>	'a950ad74ff25405582b099036ba3b249',
		'rest_url'			=>	'https://app.cloopen.com:8883',
		'appid'				=>	'8aaf07086772ac6101677fabcd290e39',
		'apptoken'			=>	'237faa32844d40ba364e8c7063eb6b5e',
		'version'			=>	'2013-12-26',

		// 选填阿里云
		/*'aliyun'			=>	[											// 下面属于阿里云的
			'SignName'			=>	'',
			'TemplateCode'		=>	'',
			'accessKeyId'		=>	'',
			'accessKeySecret'	=>	'',
			'security'			=>	true,
			'domain'			=>	'dysmsapi.aliyuncs.com',
		],*/
	],

	'exchange_key'			=>	'',

	'businesses'			=>	[											// 所有业务类型
		10					=>	'交易买入',
		11					=>	'交易卖出',
		12					=>	'交易取消',
		13					=>	'转账转出',
		14					=>	'转账转入',
		15					=>	'imtoken充值',
		16					=>	'imtoken提现',
		17					=>	'imtoken提现失败',
		18					=>	'共享蚁巢',
		19					=>	'购买算力道具',
		20					=>	'购买鱼池',
		21					=>	'蚁巢结算',
		22					=>	'商城购物',
		23					=>	'刮刮卡',
		24					=>	'商城收益',
      	25					=>	'幸运彩蛋奖',
		29					=>	'团队蚁后佣金',
		30					=>	'团队蚁后收益',
		31					=>	'团队交易收益',
		32					=>	'全球交易分红',
		33					=>	'链上合约 - 一口价',
		34					=>	'链上合约 - 团购',
		35					=>	'链上合约 - 转让',
		36					=>	'链上合约 - 出售',
		37					=>	'链上合约 - 收益',
		38					=>	'链上合约 - 佣金',
		39					=>	'链上合约 - 代理佣金',
		40					=>	'参与众筹',
		41					=>	'众筹成功',
		42					=>	'众筹取消',
		50					=>	'升级奖励',
		88					=>	'系统奖励',
		101					=>	'推荐奖励',
		102					=>	'扣除可售',
		103					=>	'蚁巢释放',
		104					=>	'可售额度签到',
		105					=>	'解封扣除',
		106					=>	'转入蚁巢',
		108					=>	'内排认购',
      	188					=>	'一元购',
	],

	'log'					=>	[											// 日志类型，不建议修改
		1					=>	'注册并登录',
		2					=>	'注册账户',
		3					=>	'登录账户',
		4					=>	'找回密码',
		5					=>	'修改登录密码',
		6					=>	'修改安全密码',
		7					=>	'更新资料',
		8					=>	'实名认证',
		9					=>	'退出登录',
		10					=>	'管理员更新用户资料',
		11					=>	'管理员调整用户资金',
		12					=>	'管理员审核实名认证',
		13					=>	'管理员修改用户密码',
		14					=>	'管理员调整用户级别',
		15					=>	'管理员调整用户状态',
		16					=>	'QQ快速登录',
		17					=>	'微信快速登录',
		20					=>	'刮刮卡',
		21					=>	'刮刮卡提货',
		30					=>	'购买蚁后',
		31					=>	'一键收矿',
		32					=>	'商城购物',
		60					=>	'交易买入',
		61					=>	'交易卖出',
		62					=>	'用户转账',
		63					=>	'每日签到',
		64					=>	'imtoken充值',
		65					=>	'imtoken提现',
		66					=>	'共享蚁巢 - 领取收益',
		67					=>	'算力道具',
		101					=>	'推荐奖励',
	],

	'default_currency'		=>	1,											// 默认货币
	'currencys'				=>	[											// 货币集合
		1					=>	[
			'name'			=>	'可售YCB',								 	 // 货币名称
			'field'			=>	'money',									// 数据库字段
			'businesses'	=>	[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 30, 31, 32, 50, 80, 81, 82, 108, 188],
		],
		2					=>	[
			'name'			=>	'冻结YCB',
			'field'			=>	'deposit',
			'businesses'	=>	[11, 12, 80, 81, 82],
		],
		3					=>	[
			'name'			=>	'可用积分',
			'field'			=>	'score',
			'businesses'	=>	[20, 22, 24, 88],
		],
		4					=>	[
			'name'			=>	'冻结积分',
			'field'			=>	'score_deposit',
			'businesses'	=>	[20, 22, 24, 88],
		],
      	6					=>	[
			'name'			=>	'蚁后积分',
			'field'			=>	'macmoney',
			'businesses'	=>	[20,101],
		],
        7					=>	[
            'name'			=>	'蚁巢钱包',
            'field'			=>	'mpocket',
            'businesses'	=>	[106],
        ],
        8					=>	[
            'name'			=>	'蚁巢',
            'field'			=>	'poll',
            'businesses'	=>	[106],
        ],
        9					=>	[
            'name'			=>	'可售额度',
            'field'			=>	'cansell',
            'businesses'	=>	[106],
        ],
	],
	'score'					=>	[											// 积分配置
		'enable'			=>	false,										// 是否启用
		'unit'				=>	'积分',										// 单位
	],

	'trade'					=>	[											// 交易配置
		'time'				=>	[											// 开盘时间
			[
				'open'		=>	'00:00:00',
				'close'		=>	'24:00:00',
			],			
		],
		'limit'				=>	5,											// 每人未完成的订单买入卖出分别最多允许多少笔
		'charge'			=>	0.25,										// 交易手续费
		'buy'				=>	[											// 买入配置
			'number'		=>	[											// 买入数量
				'max'		=>	1000,										// 最多买入数量
				'min'		=>	1,											// 最少买入数量
			],
			'allow'			=>	[],											// 为空表示不限制，在这里添加账号，表示只允许这部分人出售
		],
		'sell'				=>	[											// 卖出配置
			'number'		=>	[											// 卖出数量
				'max'		=>	1000,										// 最多卖出数量
				'min'		=>	10,											// 最少卖出数量
			],
			'allow'			=>	[											// 为空表示不限制，在这里添加账号，表示只允许这部分人出售
			],

		],
		'status'			=>	[											// 订单状态
			0	=>	[
				'name' 		=>	'已取消',									// 状态类型
			],
			1	=>	[
				'name' 		=> 	'匹配中',
			],
			2	=>	[
				'name' 		=> 	'待付款',
			],
			3	=>	[
				'name' 		=> 	'待确认',
			],
			4	=>	[
				'name' 		=> 	'投诉中',
			],
			8	=>	[
				'name' 		=> 	'成交',
			],
		],
	],

	'transfer'				=>	[											// 转账配置
		'charge'			=>	0,
	],

	'event'					=>	[											// 活动配置
		'scratch'			=>	[											// 刮刮卡
			'enable'			=>	false,									// 是否开启
			'time'				=>	[										// 开放时间
				[
					'open'		=>	'09:30:00',
					'close'		=>	'11:30:00',
				],
				[
					'open'		=>	'13:00:00',
					'close'		=>	'15:00:00',
				],
				[
					'open'		=>	'20:00:00',
					'close'		=>	'22:00:00',
				],
			],
			'chance'			=>	[										// 机会配置
				'people'		=>	20,										// 每满20人，增加一次机会，为0代表机会无限
			],
			'reward'			=>	[										// 奖品配置
				[
					'id'		=>	1001,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'入门级蚁后',							// 奖品名称
					'type'		=>	1,										// 类型，1：蚁后，2：实物，3：话费
					'machine'	=>	2,										// 对应蚁后的ID，类型为蚁后时该项必填
					'percent'	=>	0.8,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	100,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1002,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'初级蚁后',								// 奖品名称
					'type'		=>	1,										// 类型，1：蚁后，2：实物，3：话费
					'machine'	=>	3,										// 对应蚁后的ID，类型为蚁后时该项必填
					'percent'	=>	0.2,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	100,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1003,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'iPhoneX',								// 奖品名称
					'type'		=>	2,										// 类型，1：蚁后，2：实物，3：话费
					'percent'	=>	0.3,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	100,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1004,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'500元话费',								// 奖品名称
					'type'		=>	3,										// 类型，1：蚁后，2：实物，3：话费
					'percent'	=>	0.4,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	100,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
			],
			'rule'				=>	[										// 活动规则，一条一行
				'奖品包括蚁后、iPhoneX、话费等',
				'团队成员每增加20人，将会得到一次刮刮乐的机会',
				'限时开放，早上8点到9点，晚上8点到9点',
				'实物将于7个工作日内发货，其他奖品立即到账',
				'解释权归平台所有',
			],
		],
		'pool'                  =>  [                   					// 共享蚁巢
            'enable'            =>  true,              					// 是否开启
            'volume'            =>  10000000,           					// 剩余容量
            'complexity'        =>  1850123315,         					// 起始复杂度
            'percent'			=>	0.00001,								// 算力和收益的比例，可以是0.0001比1，也可以是1比1
            'float'				=>	0.01,									// 浮动比例，比如收益100个货币，浮动0.01，最终可能是101，也可能是99
            'interval'			=>	60 * 60,								// 收益的时间间隔，单位是秒
            'background'		=>	'/static/image/pool/bg.png',			// 背景图片
        ],
	],

	'contact'				=>	[											// 联系我们
		'interval'			=>	60,											// 每次发言间隔，单位是秒
	],

	'oauth'					=>	[											// 第三方授权
		'wechat'			=>	[											// 微信授权
			'enable'		=>	false,										// 是否启用
		],
		'qq'				=>	[											// QQ授权
			'enable'		=>	false,										// 是否启用
			'appid'			=>	'101475973',
			'appkey'		=>	'',
		],
	],

	'store'					=>	[											// 商城配置
		'seller'			=>	[											// 商家服务
			'enable'		=>	true,										// 是否开启
			'audit'			=>	true,										// 商品是否需要审核
			'catalog'		=>	[4, 5, 6],									// 允许发布的类目
			'limit'			=>	[											// 每人允许发布的商品数量
				1			=>	5,											// 1级可发1个
				2			=>	5,											// 2级可发2个
				3			=>	5,
				4			=>	5,
				5			=>	5,
				6			=>	5,
				7			=>	5,
				8			=>	5,
			],
			'charge'		=>	0.2,										// 成交手续费
		],
		'catalog'			=>	[											// 产品类目
			1 				=>	'蚁后',										// 1固定为蚁后，只能改名字
			2 				=>	'汽车',										// 2固定为道具，只能改名字
			3 				=>	'数码',										// 3固定为官方发布的产品，只能改名字
			4 				=>	'生活',										// 从4起，可以是用户自己发布的产品，可自由更改添加
			5 				=>	'家电',
			6				=>	'食品',
            7				=>	'居家',
            8				=>	'珠宝',
            9				=>	'酒水',
            10				=>	'活动',
		],
		'machine'			=>	[											// 蚁后配置
			'activation'	=>	false,										// 购买蚁后是否需要使用激活码
			'rebate'		=>	false,										// 购买蚁后是否立即返利给上级
		],
	],

	'contract'				=>	[											// 合约配置
		'enable'			=>	true,										// 是否开启
		'agent'				=>	[],											// 代理商列表，用户账号 => 比例
		'commission'		=>	0.02,										// 佣金比例
		'catalog'			=>	[
			1				=>	'名人',
			2				=>	'书画',
			3				=>	'古董',
			4				=>	'品牌',
			5				=>	'宠物',
			6				=>	'游戏',
			7				=>	'汽车',
		],
	],

	'funding'				=>	[											// 众筹配置
		'enable'			=>	true,										// 是否开启
		'charge'			=>	0.2,										// 手续费
		'expire'			=>	15,											// 项目默认15天到期
		'audit'				=>	true,										// 是否需要审核
		'catalog'			=>	[
			1				=>	'创业',
			2				=>	'公益',
			3				=>	'慈善',
		],
		'condition'			=>	[											// 发布条件
			49999			=>	1000,										// 发布小于等于49999的，需要在投入最少1000货币
			99999			=>	5000,
			499999			=>	10000,
			999999			=>	50000,
			PHP_INT_MAX		=>	100000,
		],
		'level'				=>	[											// 用户档次
			[1000, 4999], [5000, 9999], [10000, 49999], [50000, 99999], [100000, PHP_INT_MAX],
		],
		'max'				=>	10000000,
	],
];