<?php

return array(

    // Widget

    'loadingLabel'           => 'Загрузка...',
    'loginError'             => 'Ошибка авторизации',
    'chatHeader'             => 'Мы онлайн!',
    'startInfo'              => 'Пожалуйста заполните форму для возможности общения',
    'selectDepartment'       => 'Выберите отдел',
    'selectCancel'           => 'Отменить',
    'startLabel'             => 'Начать',
    'backLabel'              => 'Вернуться',
    'initMessageBody'        => 'Здравствуйте, чем мы можем Вам помочь?',
    'initMessageAuthor'      => 'Оператор',
    'chatInputLabel'         => 'Напишите свой вопрос',
    'timeDaysAgo'            => 'дн. назад',
    'timeHoursAgo'           => 'ч. назад',
    'timeMinutesAgo'         => 'мин. назад',
    'timeSecondsAgo'         => 'сек. назад',
    'offlineMessage'         => 'Оператор не всети',
    'toggleSoundLabel'       => 'Звуковые эффекты',
    'toggleScrollLabel'      => 'Авто-прокрутка',
    'toggleEmoticonsLabel'   => 'Эмоджи',
    'toggleMediaLabel'       => 'Медиа',
    'toggleAutoShowLabel'    => 'Авто-отображение',
    'toggleFullscreenLabel'  => 'Развернуть в полный экран',
    'endChatLabel'           => 'Завершить общение',
    'endChatConfirmQuestion' => 'Вы уверены?',
    'endChatConfirm'         => 'Да',
    'endChatCancel'          => 'Отмена',
    'mailTranscriptLabel'    => 'Отправить стенограмму разговора <br>по электронной почте',
    'mailTranscriptHeader'   => 'Стенограмма беседы',
    'mailTranscriptInfo'     => 'Пожалуйста, введите электронную почту для отправки стенограммы этой беседы',
    'mailTranscriptSuccess'  => 'Ваше сообщение отправлено.',
    'mailTranscriptError'    => 'Произошла ошибка во время отправки сообщения',
    'operatorClosedTalk'     => 'Оператор прекратил общение',
    'loginAgain'             => 'Авторизироваться снова',
    'contactHeader'          => 'Напишите нам',
    'contactInfo'            => 'Все операторы не в сети. Используйте форму снизу для отправки сообщения на нашу электронную почту.',
    'contactNameLabel'       => 'Ваше имя',
    'contactMailLabel'       => 'Ваша эл.почта',
    'contactQuestionLabel'   => 'Ваш вопрос',
    'contactSendLabel'       => 'Отправить',
    'contactSuccessHeader'   => 'Сообщение отправлено',
    'contactSuccessMessage'  => 'Ваш вопрос был отправлен. Спасибо!',
    'contactErrorHeader'     => 'Ошибка',
    'contactErrorMessage'    => 'Произошла ошибка при отправе сообщения',
    'file.canceled'          => 'Отменено',
    'file.error'             => 'Ошибка',
    'file.denied'            => 'Отклонено',
    'file.too.big'           => 'Максимальный размер файла: %max% Мб',
    'you'                    => 'Вы',

    // Administration side

    'app.name' => 'мш24.рф - LiveChat',

    'login.title' => 'Логин',
    'login.intro' => 'Пожалуйста, войдите в систему, используя следующую форму',
    'login.error' => 'Неправильный адресс эл.почты или пароль',
    'login' => 'Логин',
    'your.mail' => 'Ваша эл.почта',
    'your.pass' => 'Ваш пароль',
    'your.msg' => 'Напишите своё сообщение',
    'online' => 'В сети',
    'offline' => 'Не в сети',
    'welcome' => '',
    'edit.profile' => 'Редактировать профиль',
    'edit.operator' => 'Изменить оператора',
    'add.new.msg' => 'Добавить новое сообщение',
    'add.new.operator' => 'Добавить нового оператора',
    'add.new.dep' => 'Добавить новый отдел',
    'incorrect.install' => 'Ошибка установки',
    'please.install' => 'Пожалуйста сначала установите',
    'not.installed.msg' => 'Приложение не установлена. Пожалуйста, зайдите в роли администратора и установите приложение.',
    'install' => 'Установить',
    'edit.config' => 'Изменить конфигурацию',
    'uninstall' => 'Удалить',
    'qr.code' => 'QR-код',
    'qr.code.info' => 'Мобильное приложение может отсканировать QR-код для подключения.',
    'qr.code.note' => "Для подключения через QR-код нужно официальное приложение.<br>Пожалуйста, вначале скачайте и установите PHP Live Chat мобильное приложение.",
    'logs' => 'Логи',
    'widget.preview' => 'Предпросмотр виджета',
    'widget.get' => 'Получить скрипт виджета',
    'logout' => 'Выйти',
    'chat.offline.info' => 'Пожалуйста, измените свой статус на в сети для продлжения общения.',
    'online.users' => 'Пользователи в сети',
    'online.operators' => 'Операторы в сети',
    'user.info' => 'Информация о пользователе',
    'visitor.invite' => 'Приглашение для посетителей',
    'invite.visitor.q' => 'Пригласить посетителей для общения?',
    'invite' => 'Пригласить',
    'settings' => 'Настройки',
    'departments' => 'Отделы',
    'operators' => 'Операторы',
    'widget.settings' => 'Настройки виджета',
    'widget.theme' => 'Тема виджета',
    'canned.messages' => 'Стандартные сообщения',
    'widget.blacklist' => 'Чёрный список виджета',
    'history' => 'История',
    'primary.color' => 'Основной цвет',
    'secondary.color' => 'Второй цвет',
    'label.color' => 'Цвет ярлыка',
    'contact.mail' => 'Контактная форма электронной почты',
    'hide.offline' => 'Спрятать, когда не в сети',
    'show.widget.auto' => 'Показывать виджет автоматически',
    'every.refresh' => 'Обновлять на каждой странице',
    'first.visit' => 'Только вначале списка',
    'until.hide' => 'Пока пользователь не спрячет виджет',
    'allow' => 'Разрешить',
    'turn.off' => 'Выключить',
    'show.widget.after' => 'Показать виджет автоматически после (секунд)',
    'ask.mail' => 'Спросите гостей по электронной почте',
    'media.in.chat' => 'Медиа файлы в диалоге (картинки, видео)',
    'display.auto' => 'Отображать автоматчески',
    'display.clicked' => 'Отображать по нажатию',
    'chat.header' => 'Заголовок чата',
    'welcome.msg' => 'Приветственное сообщение',
    'msg.sound' => 'Новый звук сообщения',
    'sys.msg.sound' => 'Системный звук сообщения',
    'shared.max.size' => 'Максимальный размер файла (Мб)',
    'file.sharing' => 'Обмен файлами',
    'gmaps.key' => 'API ключ Google карт',
    'widget.width' => "Ширина виджета (в пикселях, минимум 370)",
    'widget.height' => "Высота виджета (в пикселях)",
    'widget.side' => "Расположение виджета",
    'left' => 'Слева',
    'right' => 'Справа',
    'widget.offset' => "Смещение виджета с края окна (в пикселях)",
    'mobile.bp' => 'Контрольная точка мобильной версии',
    'operator.init.chat' => 'Операторские переговоры',
    'online.track.int' => 'Частота обновления отслеживания пользователя',
    'max.conn' => 'Максимальное количество соединений',
    'poll.interval' => 'Частота обновления чата',
    'save' => 'Сохранить',
    'reset.to.def' => 'Вернуть к исходным',
    'departments' => 'Отделы',
    'add.new' => 'Добавить новый',
    'edit.department' => 'Изменить отдел',
    'back.to.list' => 'Вернуться к списку',
    'name' => 'Имя',
    'description' => 'Описание',
    'edit.op' => 'Изменить оператора',
    'user.name' => 'Имя пользователя',
    'mail' => 'Эл.почта',
    'user' => 'Пользователь',
    'pass' => 'Пароль',
    'retype.pass' => 'Повторите пароль',
    'avatar' => 'Аватар',
    'from.coll' => 'Из коллекции...',
    'curr.pass' => 'Текущий пароль',
    'new.pass' => 'Новый пароль',
    'retype.new.pass' => 'Повторите новый пароль',
    'change.pass' => 'Изменить пароль',
    'cancel' => 'Отмена',
    'insert' => 'Вставить',
    'send' => 'Отправить',
    'canned.msgs' => 'Стандартные сообщения',
    'edit.msg' => 'Изменить сообщение',
    'body' => 'Сообщение',
    'placeholder.hint' => 'Вы можете использовать <i>{name}</i> и <i>{mail}</i>',
    'pages.no.widget' => 'Страницы в виджете не могут быт отображеы:',
    'no.widget.hint' => '(определите каждый URL или часть URL как отдельную строку, вы также можете использовать регулярные выражения, т.п. <i>/test\.html$/</i>)',
    'search' => 'Поиск',
    'clear.history' => 'Очистить историю',
    'clear.history.q' => 'Вы уверены, что хотите очисить всю исторю?',
    'clear.messages' => 'Очистить сообщения',
    'participants' => 'Участники',
    'refresh' => 'Обновить',
    'open.in.n.w' => 'Открыть в новом окне',
    'clear' => 'Очистить',
    'from.date' => 'С даты',
    'to.date' => 'По дату',
    'uninstall.title' => 'Удаление',
    'uninstall.success' => 'Приложение и база данных были успешно удалены. Однако сама база данных по-прежнему существует (возможно, вы захотите удалить ее вручную, если необходимо).',
    'admin.panel' => 'Админ панель',
    'uninstall.intro' => "Страница удаления приложения. Если вы боьше не собираетесь спользовать приложение, продолжите удалеие нажав на кнопку <i>Удалить</i>.

                <br><br>

                Деинсталляция означает, что учетные записи операторов, история сообщений и сохраненные сообщения будут удалены. Учетная запись администратора
                останется доступной, и вы сможете снова зарегистрироваться позже. Таблицы базы данных будут удалены, но база данных
                сама по себе будет существовать (возможно, вы захотите удалить ее вручную, если необходимо).

                <br><br>

                <strong>
                    После завершения процесса удаления все данные приложения (учетные записи операторов, история сообщений, консервированные сообщения) будут потеряны.
                    При необходимости перед деинсталляцией вы можете создавать резервные копии таблиц базы данных приложений с помощью вашего любимого инструмента администрирования базы данных (например, <i>phpMyAdmin</i>).
                </strong>",
    'uninstall.err' => 'При деинсталяции что-то пошло не так. Ошибка связаная с базой данных:',
    'widget.test' => 'Тест виджета',
    'install.title' => 'Конфигурации',
    'install.intro' => "Добро пожаловать в %app%. Перед началом, приложение необходимо настроить на
                работу вместе с сервером базы данных. Вам понадобится следующая информация
                (если вы не знаете эти данные, вы можете получить их от своего веб-хостинга):

                <br><br>

                1. Хост БД <br>
                2. Порт БД (только если он отличается от стандартного) <br>
                3. Название БД <br>
                4. Пользовательское имя БД <br>
                5. Пароль от БД

                <br><br>

                <strong>
                    Если данная база данных еще не существует, мастер установки попытается автоматически ее создать
                    для вас. Однако на некоторых серверах эта попытка может быть неудачой. Не волнуйтесь, Вы можете создать базу данных
                    вручную используя ваш любимый инструмент администрирования базы данных (например, <i>phpMyAdmin</i>) и вернуться на эту страницу
                    после завершения.
                </strong>",
    'lets.go' => "Начинаем!",
    'wizard.2.title' => 'Установка',
    'wizard.2.intro' => 'Проверьте павильность введённых данных и нажмите кнопку <i>Установить</i>.',
    'db.settings' => 'Настройки БД',
    'host' => 'Хост',
    'port' => 'Порт',
    'db.name' => 'Назваие базы данных',
    'smtp' => 'SMTP',
    'use.smtp' => 'Использовать SMTP',
    'encryption' => 'Шифрование',
    'hosts' => 'Хост(ы)',
    'hosts.i' => 'Хост(ы), отдельный с ;',
    'admin.acc.settings' => 'Настройки учетной записи администратора',
    'other.settings' => 'Другие настройки',
    'back' => 'Вернуться',
    'wizard.verify.intro' => 'Прежде чем приступить к установке, заполните следующую форму своим кодом покупки. Код покупки можно найти, следуя инструкциям:',
    'verify.find.code' => 'Где мой код покупки?',
    'verify.info' => 'Информация установки',
    'connection.error' => 'Ошибка соединения',
    'invalid.code.format' => 'Формат кода ошибочен',
    'invalid.purchase' => 'Код недействителен или принадлежит другому пользователю',
    'install.not.verified' => 'Установка не подтверждена',
    'purchase.code' => 'Код покупки',
    'purchase.code.original' => 'Код покупки (оригинальный)',
    'purchase.code.upgrade' => 'Код покупки (улучшенный)',
    'wizard.3.title' => 'Установка завершена',
    'wizard.3.success' => 'Установка успешно завершена! Вы можете воспользоваться панелью администратора.',
    'wizard.intro' => "
Следующие настройки являются базовой конфигурацией всего приложения.
    Они используются для связи с вашей базой данных и определения учетной записи администратора.
    Пожалуйста, заполните формы и продолжайте, нажав <i>Сохранить</i>.

    <br><br>

    <strong>
       Если данная база данных еще не существует, мастер установки попытается автоматически ее создать
                    для вас. Однако на некоторых серверах эта попытка может быть неудачой. Не волнуйтесь, Вы можете создать базу данных
                    вручную используя ваш любимый инструмент администрирования базы данных (например, <i>phpMyAdmin</i>) и вернуться на эту страницу
                    после завершения.

        <br><br>

        Если вы уже установили приложение и хотите изменить некоторые настройки, измените нужные вам значения и нажмите на кнопку <i>Сохранить</i> (существующая база данных останется безопасной и нетронутой).
    </strong>",
    'wizard.input.err' => 'Ваши входные данные недействительны, проверьте приведенные ниже сообщения об ошибках и измените информацию.',
    'wizard.files.err' => 'Для приложения требуется, чтобы некоторые файлы были доступны для записи через PHP. В настоящее время недоступны данные для записи:',
    'wizard.files.err.2' => 'Пожалуйста измените правила файла/папки для возможности перезаписи.',
    'wizard.ext.err' => 'Приложение требует, чтобы некоторые расширения PHP были доступны. В настоящее время отсутствуют следующие расширения:',
    'wizard.ext.err.2' => "Включите указанные расширения и вернитесь после завершения
        <br>
        (если вы не знаете, как это сделать, обратитесь в свою веб-хостинговую компанию).",
    'wizard.err.db' => "Приложение не может подключиться к текущей базе данных.<br>
        Пожалуйста проверьте все значении настройки в <i>БД</i> и затем удостоверьтесь, что БД запущена.",
    'wizard.err.db.2' => "Не удалось создать базу данных и таблицы.<br>
        Пожалуйста проверьте все значени и настройки в отделе <i>БД настройки</i>.

        <br><br>

        Если ваша БД — %dbName% — ещё не существует, создайте её
       вручную используя ваш любимый инструмент администрирования базы данных (например, <i>phpMyAdmin</i>) и вернитесь на эту страницу после завершения.

        <br><br>

        Ошибка по причине: %message%",
    'smtp.intro' => 'В этом разделе вы можете использовать внешний SMTP-сервер для отправки электронной почты. Вы можете оставить настройки SMTP нетронутыми, чтобы использовать сервер электронной почты по умолчанию.',
    'pass.repeat' => 'Повтор пароля',
    'value.blank' => 'Нет значения',
    'value.not.num' => 'Значение не число',
    'value.not.mail' => 'Некорректная эл.почта',
    'value.too.short' => 'Значение слишком короткое',
    'value.n.in.range' => 'Не допустимые символы',
    'values.not.match' => 'Данные не совпадают',
    'value.invalid' => 'Данные недействительны',
    'db.invalid' => 'Структура БД недействительна',
    'db.exception' => 'Исключение БД: %msg%',
    'db.tables.invalid' => 'Недопустимая структура таблицы, существующие таблицы: %actual% ожидаемые таблицы: %expected%',
    'guest.watching' => 'Гость просматривает',
    'unknown' => 'неизвестно',
    'invite.user' => 'Пригласить пользователя',
    'leave.talk' => 'Закончить разговор',
    'canned' => 'Стандартные сообщения',
    'confirm.install' => 'Подтвердите для установки приложения',
    'installation.invalid' => "Установка недействительна.
                <br><br>
                Установка невозможна из-за некорректных настроек или проблем с базами данных.
                <br><br>
                Пожалуйста проверьте настройки.",
    'delete.user.q' => 'Вы уверены, что хоите навсегда удалиь этого пользователя?',
    'bottom.right.c' => 'В нижний угол',
    'inline' => 'В любое место',
    'no.entries' => 'Нет записей',
    'select.all' => 'Выбрать всё',
    'select.none' => 'Ничего не выбрано',
    'close.talk.msg' => "В настоящий момент вы являетесь владельцем этой беседы. Вам нужно перенести его на другого
                <br>
               оператора если хотиет продолжить. Или, вы можете закрыть разговор.
                <br><br>
                Выберете опрератора, чтобы начать разговор:",
    'talk' => 'Говорить',
    'user.alrdy.in.t' => 'Пользователь уже в разговоре',
    'talk.not.exist' => 'Разговор не существует',
    'user.not.exist' => 'Пользователя не существует',
    'cant.leave.unhandled.t' => "Невозможно оставить разговор, который никто не обрабатывает",
    'only.t.owner.can.close' => "Только владелец разговоров может закрыть его",
    'only.t.owner.can.transfer' => "Только владелец разговора может передать его",
    'curr.pass.incorrect' => 'Неверный пароль',
    'user.not.found' => 'Пользователь не найден',
    'couldnt.save.user' => "Не удалось сохранить пользователя",
    'display.more' => 'Показать больше',
    'id' => 'ID',
    'ip' => 'IP',
    'show.on.map' => 'Показать на карте',
    'map.no.api.key.info' => 'Введите ключ API Google Карт на вкладке «Настройки» и обновите страницу.',
    'url' => 'Ссылка',
    'browser' => 'Браузер',
    'system' => 'Система',
    'country' => 'Страна',
    'region' => 'Регион',
    'city' => 'Город',
    'zip.code' => 'Почтовый индекс',
    'time.zone' => 'Временная зона',
    'local.time' => 'Локальное время:',
    'latitude' => 'Широта',
    'longitude' => 'Долгота',
    'contact.form.mail' => 'Контактная форма электронной почты',
    'sent.from.page' => 'Отправлено со страницы',
    'author.name' => "Имя автора",
    'author.mail' => "Электронная почта автора",
    'author.ip' => "Авторский IP-адрес",
    'message' => 'Сообщение',
    'contact.mail.note' => 'Вы можете ответить на это письмо.',
    'talk.transcript.mail.title' => 'Обсуждение разговора',
    'talk.transcript.info' => 'Загрузите вложение, в котором содержится стенограмма вашего разговора.',
    'talk.transcript.time' => 'Время',
    'talk.transcript.filename' => 'разговор-',
    'route.not.found' => 'Маршрут не найден',
    'route.not.found.msg' => '<b>/%route%</b> маршрут не найден.',
    'login.here' => 'Попробуйте авторизоваться здесь',
    'error' => 'Ошибка',
    'sth.went.wrong.msg' => "Что-то пошло не так.
            <br><br>
            Не беспокойтесь, это сообщение об ошибке поможет найти причину:",

    'db.invalid.conn' => 'Попытка использовать базу данных с недопустимым подключением.',
    'db.error' => 'Ошбика базы данных',
    'db.error.msg' => "Приложение не может подключиться к вашей базе данных. Убедитесь, что настройки базы данных верны.

                    <br><br>

                    <strong>
                       Если ваша БД — %dbName% — ещё не существует, создайте её
       вручную используя ваш любимый инструмент администрирования базы данных (например, <i>phpMyAdmin</i>) и вернитесь на эту страницу после завершения.
                    </strong>

                    <br><br>

                    Сообщени об ошибке, связанной с базой данных:",
    'sign.as.admin' => 'Войдите как администратор и исправьте настройки своей базы данных.',
    'uninstall.error' => 'Произошла ошибка во время удаления',
    'other.error' => 'Другая ошибка',
    'admin.update.error' => 'Ошибка при обновлении пользователя администратора',
    'error.saving.file' => 'Ошбика во время сохранения файла',
    'form.error' => 'Ошибка формы',
    'remove.msg' => 'Удалить "%message%"',
    'remove.msg.q' => 'Вы уверены, что хотите навсегда удалить сообщение?',
    'new.talk' => 'Новый разговор',
    'cant.chat.w.self' => "Вы не можете общаться с самим собой))",
    'select.msg' => 'Выберете сообщение',
    'select.operator' => 'Выбрать оператора',
    'invitation' => 'Приветствие',
    'leave.talk.q' => 'Вы уверены, что хотите покинуть этот диалог?',
    'leave.talk.confirm' => 'Да, покинуть диалог',
    'transfer.n.leave' => 'Передать и покинуть',
    'end.talk' => 'Закончить разговор',
    'transfer' => 'Передать',
    'leave' => 'Выйти',
    'remove.dep' => 'Удалить "%department%"',
    'remove.dep.q' => 'Вы действительно хотите удалить этот отдел навсегда?',
    'clear.history.err' => 'Ошибка при очистке истории',
    'history.cleared' => 'История сообщений очищена',
    'clear.logs' => 'Очистить логи',
    'clear.logs.q' => 'Вы уверены, что хотите очистить все логи?',
    'logs.cleared' => 'Все логи были очищены',
    'clear.logs.err' => 'Ошибка чистки логов',
    'widget.embd.code' => 'Код внедрения виджета',
    'uploading' => 'Выгрузка',
    'uploading.image' => 'Выгрузка картинки, пожалуйста подождите...',
    'avatar.uploaded' => 'Аватар загружен',
    'uploaded.success' => 'Загрузка успешно завершена',
    'remove.user' => 'Удалить "%user%"',
    'remove.user.q' => 'Вы действительно хотите удалить этого пользователя навсегда?',
    'select.avatar' => 'Выбрать аватар',
    'reset.settings' => 'Сбосить настройки',
    'reset.settings.q' => 'Вы действительно хотите сбросить все настройки?',
    'reset' => 'Сбросить',
    'alert' => 'Внимание',
    'v.cant.be.empty' => 'Значение не может быть пустым',
    'pass.have.to.match' => 'Пароли должны совпадать',
    'enter.valid.mail' => 'Введите верную эл.почту',
    'pass.need.6.chars' => 'Пароль должен быть не менее 6 символов.',
    'close' => 'Закрыть',
    'language' => 'Язык',
    'default.language' => 'Язык по-умолчанию',
    'empty.mail.placeholder' => 'no@e.mail.provided',

    // System messages

    'sm.closed.talk' => '%user% закончил разговор',
    'sm.user.closed.chat' => 'Пользователь закрыл диалог',
    'sm.now.talk.owner' => '%user% теперь владелец диалога',
    'sm.user.invited' => '%name% (%mail%) был приглашен в разговор',
    'sm.user.left' => '%name% (%mail%) вышел из разговора'
);

?>
